polls_app/app/models/response.rb

SELECT  "questions".* FROM "questions" INNER JOIN "answer_choices" ON "questions"."id" = "answer_choices"."question_id" WHERE "answer_choices"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
---
    def sibling_responses
      self.question.responses.where.not('responses.id = ?', self.id)